Tekla Open API Reference for Tekla Structures 2025
BaseWeld.ReferenceText Property
 Gets or sets the reference text.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ReferenceText { get; set; }
Public Property ReferenceText As String
	Get
	Set
Property Value
Type: String
See Also
Reference
BaseWeld Class
Tekla.Structures.Model Namespace